# St7FaceFromCavity

Converts one or more geometry face cavity loops to geometric faces.

long St7FaceFromCavity(long uID)

Input Parameters

uID

Strand7 model file ID.

Dependencies
Selection

Cavity loops can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.

Global Parameters

ivFacesCreated, ivTessellationsFailed, ivLoopsDeleted.